arendst/Tasmota/arduino/version 2.4.2/boards.txt
##############################################################
espduino.name=ESPDuino (ESP-13 Module)
espduino.build.board=ESP8266_ESP13
espduino.build.variant=ESPDuino
espduino.menu.ResetMethod.v2=ESPduino-V2
espduino.menu.ResetMethod.v2.upload.resetmethod=nodemcu
espduino.menu.ResetMethod.v1=ESPduino-V1
espduino.menu.ResetMethod.v1.upload.resetmethod=ck
espduino.menu.UploadTool.esptool=Serial
espduino.menu.UploadTool.esptool.upload.tool=esptool
espduino.menu.UploadTool.esptool.upload.verbose=-vv
espduino.menu.UploadTool.espota=OTA
espduino.menu.UploadTool.espota.upload.tool=espota
espduino.upload.tool=esptool
espduino.upload.maximum_data_size=81920
espduino.upload.wait_for_upload_port=true
espduino.upload.erase_cmd=
espduino.serial.disableDTR=true
espduino.serial.disableRTS=true
espduino.build.mcu=esp8266
espduino.build.core=esp8266
espduino.build.spiffs_pagesize=256
espduino.build.debug_port=
espduino.build.debug_level=
espduino.menu.CpuFrequency.80=80 MHz
espduino.menu.CpuFrequency.80.build.f_cpu=80000000L
espduino.menu.CpuFrequency.160=160 MHz
espduino.menu.CpuFrequency.160.build.f_cpu=160000000L
espduino.menu.VTable.flash=Flash
espduino.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espduino.menu.VTable.heap=Heap
espduino.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espduino.menu.VTable.iram=IRAM
espduino.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espduino.build.flash_mode=dio
espduino.build.flash_freq=40
espduino.menu.FlashSize.4M1M=4M (1M SPIFFS)
espduino.menu.FlashSize.4M1M.build.flash_size=4M
espduino.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
espduino.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espduino.menu.FlashSize.4M1M.build.spiffs_pagesize=256
espduino.menu.FlashSize.4M1M.upload.maximum_size=1044464
espduino.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
espduino.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espduino.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espduino.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espduino.menu.FlashSize.4M2M=4M (2M SPIFFS)
espduino.menu.FlashSize.4M2M.build.flash_size=4M
espduino.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
espduino.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espduino.menu.FlashSize.4M2M.build.spiffs_pagesize=256
espduino.menu.FlashSize.4M2M.upload.maximum_size=1044464
espduino.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
espduino.menu.FlashSize.4M2M.build.spiffs_start=0x200000
espduino.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
espduino.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
espduino.menu.FlashSize.4M3M=4M (3M SPIFFS)
espduino.menu.FlashSize.4M3M.build.flash_size=4M
espduino.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
espduino.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espduino.menu.FlashSize.4M3M.build.spiffs_pagesize=256
espduino.menu.FlashSize.4M3M.upload.maximum_size=1044464
espduino.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
espduino.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espduino.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espduino.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espduino.menu.LwIPVariant.v2mss536=v2 Lower Memory
espduino.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
espduino.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
espduino.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
espduino.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
espduino.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
espduino.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
espduino.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
espduino.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
espduino.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
espduino.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
espduino.menu.LwIPVariant.OpenSource=v1.4 Compile from source
espduino.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
espduino.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
espduino.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espduino.menu.Debug.Disabled=Disabled
espduino.menu.Debug.Disabled.build.debug_port=
espduino.menu.Debug.Serial=Serial
espduino.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espduino.menu.Debug.Serial1=Serial1
espduino.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espduino.menu.DebugLevel.None____=None
espduino.menu.DebugLevel.None____.build.debug_level=
espduino.menu.DebugLevel.SSL=SSL
espduino.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
espduino.menu.DebugLevel.TLS_MEM=TLS_MEM
espduino.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espduino.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
espduino.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
espduino.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
espduino.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espduino.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espduino.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
espduino.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espduino.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espduino.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espduino.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espduino.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espduino.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.DebugLevel.CORE=CORE
espduino.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
espduino.menu.DebugLevel.WIFI=WIFI
espduino.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espduino.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
espduino.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espduino.menu.DebugLevel.UPDATER=UPDATER
espduino.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espduino.menu.DebugLevel.OTA=OTA
espduino.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
espduino.menu.DebugLevel.OOM=OOM
espduino.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
espduino.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espduino.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espduino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espduino.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
espduino.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espduino.menu.FlashErase.none=Only Sketch
espduino.menu.FlashErase.none.upload.erase_cmd=
espduino.menu.FlashErase.sdk=Sketch + WiFi Settings
espduino.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
espduino.menu.FlashErase.all=All Flash Contents
espduino.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
espduino.menu.UploadSpeed.115200=115200
espduino.menu.UploadSpeed.115200.upload.speed=115200
espduino.menu.UploadSpeed.9600=9600
espduino.menu.UploadSpeed.9600.upload.speed=9600
espduino.menu.UploadSpeed.57600=57600
espduino.menu.UploadSpeed.57600.upload.speed=57600
espduino.menu.UploadSpeed.230400.linux=230400
espduino.menu.UploadSpeed.230400.macosx=230400
espduino.menu.UploadSpeed.230400.upload.speed=230400
espduino.menu.UploadSpeed.256000.windows=256000
espduino.menu.UploadSpeed.256000.upload.speed=256000
espduino.menu.UploadSpeed.460800.linux=460800
espduino.menu.UploadSpeed.460800.macosx=460800
espduino.menu.UploadSpeed.460800.upload.speed=460800
espduino.menu.UploadSpeed.512000.windows=512000
espduino.menu.UploadSpeed.512000.upload.speed=512000
espduino.menu.UploadSpeed.921600=921600
espduino.menu.UploadSpeed.921600.upload.speed=921600

