arendst/Tasmota/arduino/version 2.4.2/boards.txt
##############################################################
nodemcu.name=NodeMCU 0.9 (ESP-12 Module)
nodemcu.build.board=ESP8266_NODEMCU
nodemcu.build.variant=nodemcu
nodemcu.upload.tool=esptool
nodemcu.upload.maximum_data_size=81920
nodemcu.upload.wait_for_upload_port=true
nodemcu.upload.erase_cmd=
nodemcu.serial.disableDTR=true
nodemcu.serial.disableRTS=true
nodemcu.build.mcu=esp8266
nodemcu.build.core=esp8266
nodemcu.build.spiffs_pagesize=256
nodemcu.build.debug_port=
nodemcu.build.debug_level=
nodemcu.menu.CpuFrequency.80=80 MHz
nodemcu.menu.CpuFrequency.80.build.f_cpu=80000000L
nodemcu.menu.CpuFrequency.160=160 MHz
nodemcu.menu.CpuFrequency.160.build.f_cpu=160000000L
nodemcu.menu.VTable.flash=Flash
nodemcu.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
nodemcu.menu.VTable.heap=Heap
nodemcu.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
nodemcu.menu.VTable.iram=IRAM
nodemcu.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
nodemcu.upload.resetmethod=nodemcu
nodemcu.build.flash_mode=qio
nodemcu.build.flash_freq=40
nodemcu.menu.FlashSize.4M1M=4M (1M SPIFFS)
nodemcu.menu.FlashSize.4M1M.build.flash_size=4M
nodemcu.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
nodemcu.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
nodemcu.menu.FlashSize.4M1M.build.spiffs_pagesize=256
nodemcu.menu.FlashSize.4M1M.upload.maximum_size=1044464
nodemcu.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
nodemcu.menu.FlashSize.4M1M.build.spiffs_start=0x300000
nodemcu.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
nodemcu.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
nodemcu.menu.FlashSize.4M2M=4M (2M SPIFFS)
nodemcu.menu.FlashSize.4M2M.build.flash_size=4M
nodemcu.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
nodemcu.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
nodemcu.menu.FlashSize.4M2M.build.spiffs_pagesize=256
nodemcu.menu.FlashSize.4M2M.upload.maximum_size=1044464
nodemcu.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
nodemcu.menu.FlashSize.4M2M.build.spiffs_start=0x200000
nodemcu.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
nodemcu.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
nodemcu.menu.FlashSize.4M3M=4M (3M SPIFFS)
nodemcu.menu.FlashSize.4M3M.build.flash_size=4M
nodemcu.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
nodemcu.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
nodemcu.menu.FlashSize.4M3M.build.spiffs_pagesize=256
nodemcu.menu.FlashSize.4M3M.upload.maximum_size=1044464
nodemcu.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
nodemcu.menu.FlashSize.4M3M.build.spiffs_start=0x100000
nodemcu.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
nodemcu.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
nodemcu.menu.LwIPVariant.v2mss536=v2 Lower Memory
nodemcu.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
nodemcu.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
nodemcu.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
nodemcu.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
nodemcu.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
nodemcu.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
nodemcu.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
nodemcu.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
nodemcu.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
nodemcu.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
nodemcu.menu.LwIPVariant.OpenSource=v1.4 Compile from source
nodemcu.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
nodemcu.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
nodemcu.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
nodemcu.menu.Debug.Disabled=Disabled
nodemcu.menu.Debug.Disabled.build.debug_port=
nodemcu.menu.Debug.Serial=Serial
nodemcu.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
nodemcu.menu.Debug.Serial1=Serial1
nodemcu.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
nodemcu.menu.DebugLevel.None____=None
nodemcu.menu.DebugLevel.None____.build.debug_level=
nodemcu.menu.DebugLevel.SSL=SSL
nodemcu.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
nodemcu.menu.DebugLevel.TLS_MEM=TLS_MEM
nodemcu.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
nodemcu.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
nodemcu.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
nodemcu.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
nodemcu.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
nodemcu.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
nodemcu.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
nodemcu.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
nodemcu.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
nodemcu.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
nodemcu.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
nodemcu.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
nodemcu.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
nodemcu.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
nodemcu.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
nodemcu.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nodemcu.menu.DebugLevel.CORE=CORE
nodemcu.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
nodemcu.menu.DebugLevel.WIFI=WIFI
nodemcu.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
nodemcu.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
nodemcu.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
nodemcu.menu.DebugLevel.UPDATER=UPDATER
nodemcu.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
nodemcu.menu.DebugLevel.OTA=OTA
nodemcu.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
nodemcu.menu.DebugLevel.OOM=OOM
nodemcu.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
nodemcu.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
nodemcu.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
nodemcu.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
nodemcu.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
nodemcu.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
nodemcu.menu.FlashErase.none=Only Sketch
nodemcu.menu.FlashErase.none.upload.erase_cmd=
nodemcu.menu.FlashErase.sdk=Sketch + WiFi Settings
nodemcu.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
nodemcu.menu.FlashErase.all=All Flash Contents
nodemcu.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
nodemcu.menu.UploadSpeed.115200=115200
nodemcu.menu.UploadSpeed.115200.upload.speed=115200
nodemcu.menu.UploadSpeed.9600=9600
nodemcu.menu.UploadSpeed.9600.upload.speed=9600
nodemcu.menu.UploadSpeed.57600=57600
nodemcu.menu.UploadSpeed.57600.upload.speed=57600
nodemcu.menu.UploadSpeed.230400.linux=230400
nodemcu.menu.UploadSpeed.230400.macosx=230400
nodemcu.menu.UploadSpeed.230400.upload.speed=230400
nodemcu.menu.UploadSpeed.256000.windows=256000
nodemcu.menu.UploadSpeed.256000.upload.speed=256000
nodemcu.menu.UploadSpeed.460800.linux=460800
nodemcu.menu.UploadSpeed.460800.macosx=460800
nodemcu.menu.UploadSpeed.460800.upload.speed=460800
nodemcu.menu.UploadSpeed.512000.windows=512000
nodemcu.menu.UploadSpeed.512000.upload.speed=512000
nodemcu.menu.UploadSpeed.921600=921600
nodemcu.menu.UploadSpeed.921600.upload.speed=921600

