arendst/Tasmota/arduino/version 2.4.2/boards.txt
##############################################################
esp210.name=SweetPea ESP-210
esp210.build.board=ESP8266_ESP210
esp210.upload.tool=esptool
esp210.upload.maximum_data_size=81920
esp210.upload.wait_for_upload_port=true
esp210.upload.erase_cmd=
esp210.serial.disableDTR=true
esp210.serial.disableRTS=true
esp210.build.mcu=esp8266
esp210.build.core=esp8266
esp210.build.variant=generic
esp210.build.spiffs_pagesize=256
esp210.build.debug_port=
esp210.build.debug_level=
esp210.menu.CpuFrequency.80=80 MHz
esp210.menu.CpuFrequency.80.build.f_cpu=80000000L
esp210.menu.CpuFrequency.160=160 MHz
esp210.menu.CpuFrequency.160.build.f_cpu=160000000L
esp210.menu.VTable.flash=Flash
esp210.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
esp210.menu.VTable.heap=Heap
esp210.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
esp210.menu.VTable.iram=IRAM
esp210.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
esp210.upload.resetmethod=ck
esp210.build.flash_mode=qio
esp210.build.flash_freq=40
esp210.menu.FlashSize.4M1M=4M (1M SPIFFS)
esp210.menu.FlashSize.4M1M.build.flash_size=4M
esp210.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
esp210.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
esp210.menu.FlashSize.4M1M.build.spiffs_pagesize=256
esp210.menu.FlashSize.4M1M.upload.maximum_size=1044464
esp210.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
esp210.menu.FlashSize.4M1M.build.spiffs_start=0x300000
esp210.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
esp210.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
esp210.menu.FlashSize.4M2M=4M (2M SPIFFS)
esp210.menu.FlashSize.4M2M.build.flash_size=4M
esp210.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
esp210.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
esp210.menu.FlashSize.4M2M.build.spiffs_pagesize=256
esp210.menu.FlashSize.4M2M.upload.maximum_size=1044464
esp210.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
esp210.menu.FlashSize.4M2M.build.spiffs_start=0x200000
esp210.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
esp210.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
esp210.menu.FlashSize.4M3M=4M (3M SPIFFS)
esp210.menu.FlashSize.4M3M.build.flash_size=4M
esp210.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
esp210.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
esp210.menu.FlashSize.4M3M.build.spiffs_pagesize=256
esp210.menu.FlashSize.4M3M.upload.maximum_size=1044464
esp210.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
esp210.menu.FlashSize.4M3M.build.spiffs_start=0x100000
esp210.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
esp210.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
esp210.menu.LwIPVariant.v2mss536=v2 Lower Memory
esp210.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
esp210.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
esp210.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
esp210.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
esp210.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
esp210.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
esp210.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
esp210.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
esp210.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
esp210.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
esp210.menu.LwIPVariant.OpenSource=v1.4 Compile from source
esp210.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
esp210.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
esp210.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
esp210.menu.Debug.Disabled=Disabled
esp210.menu.Debug.Disabled.build.debug_port=
esp210.menu.Debug.Serial=Serial
esp210.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
esp210.menu.Debug.Serial1=Serial1
esp210.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
esp210.menu.DebugLevel.None____=None
esp210.menu.DebugLevel.None____.build.debug_level=
esp210.menu.DebugLevel.SSL=SSL
esp210.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
esp210.menu.DebugLevel.TLS_MEM=TLS_MEM
esp210.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
esp210.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
esp210.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
esp210.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
esp210.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
esp210.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
esp210.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
esp210.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
esp210.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
esp210.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
esp210.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
esp210.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp210.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
esp210.menu.DebugLevel.CORE=CORE
esp210.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
esp210.menu.DebugLevel.WIFI=WIFI
esp210.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
esp210.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
esp210.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
esp210.menu.DebugLevel.UPDATER=UPDATER
esp210.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
esp210.menu.DebugLevel.OTA=OTA
esp210.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
esp210.menu.DebugLevel.OOM=OOM
esp210.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
esp210.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
esp210.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
esp210.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
esp210.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
esp210.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
esp210.menu.FlashErase.none=Only Sketch
esp210.menu.FlashErase.none.upload.erase_cmd=
esp210.menu.FlashErase.sdk=Sketch + WiFi Settings
esp210.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
esp210.menu.FlashErase.all=All Flash Contents
esp210.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
esp210.menu.UploadSpeed.57600=57600
esp210.menu.UploadSpeed.57600.upload.speed=57600
esp210.menu.UploadSpeed.9600=9600
esp210.menu.UploadSpeed.9600.upload.speed=9600
esp210.menu.UploadSpeed.115200=115200
esp210.menu.UploadSpeed.115200.upload.speed=115200
esp210.menu.UploadSpeed.230400.linux=230400
esp210.menu.UploadSpeed.230400.macosx=230400
esp210.menu.UploadSpeed.230400.upload.speed=230400
esp210.menu.UploadSpeed.256000.windows=256000
esp210.menu.UploadSpeed.256000.upload.speed=256000
esp210.menu.UploadSpeed.460800.linux=460800
esp210.menu.UploadSpeed.460800.macosx=460800
esp210.menu.UploadSpeed.460800.upload.speed=460800
esp210.menu.UploadSpeed.512000.windows=512000
esp210.menu.UploadSpeed.512000.upload.speed=512000
esp210.menu.UploadSpeed.921600=921600
esp210.menu.UploadSpeed.921600.upload.speed=921600

