arendst/Tasmota/arduino/version 2.4.2/boards.txt
##############################################################
espino.name=ESPino (ESP-12 Module)
espino.build.board=ESP8266_ESP12
espino.build.variant=espino
espino.upload.tool=esptool
espino.upload.maximum_data_size=81920
espino.upload.wait_for_upload_port=true
espino.upload.erase_cmd=
espino.serial.disableDTR=true
espino.serial.disableRTS=true
espino.build.mcu=esp8266
espino.build.core=esp8266
espino.build.spiffs_pagesize=256
espino.build.debug_port=
espino.build.debug_level=
espino.menu.CpuFrequency.80=80 MHz
espino.menu.CpuFrequency.80.build.f_cpu=80000000L
espino.menu.CpuFrequency.160=160 MHz
espino.menu.CpuFrequency.160.build.f_cpu=160000000L
espino.menu.VTable.flash=Flash
espino.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espino.menu.VTable.heap=Heap
espino.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espino.menu.VTable.iram=IRAM
espino.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espino.menu.ResetMethod.ck=ck
espino.menu.ResetMethod.ck.upload.resetmethod=ck
espino.menu.ResetMethod.nodemcu=nodemcu
espino.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espino.build.flash_mode=qio
espino.build.flash_freq=40
espino.menu.FlashSize.4M1M=4M (1M SPIFFS)
espino.menu.FlashSize.4M1M.build.flash_size=4M
espino.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
espino.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espino.menu.FlashSize.4M1M.build.spiffs_pagesize=256
espino.menu.FlashSize.4M1M.upload.maximum_size=1044464
espino.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
espino.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espino.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espino.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espino.menu.FlashSize.4M2M=4M (2M SPIFFS)
espino.menu.FlashSize.4M2M.build.flash_size=4M
espino.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
espino.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espino.menu.FlashSize.4M2M.build.spiffs_pagesize=256
espino.menu.FlashSize.4M2M.upload.maximum_size=1044464
espino.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
espino.menu.FlashSize.4M2M.build.spiffs_start=0x200000
espino.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
espino.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
espino.menu.FlashSize.4M3M=4M (3M SPIFFS)
espino.menu.FlashSize.4M3M.build.flash_size=4M
espino.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
espino.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espino.menu.FlashSize.4M3M.build.spiffs_pagesize=256
espino.menu.FlashSize.4M3M.upload.maximum_size=1044464
espino.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
espino.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espino.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espino.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espino.menu.LwIPVariant.v2mss536=v2 Lower Memory
espino.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
espino.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
espino.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
espino.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
espino.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
espino.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
espino.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
espino.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
espino.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
espino.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
espino.menu.LwIPVariant.OpenSource=v1.4 Compile from source
espino.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
espino.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
espino.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
espino.menu.Debug.Disabled=Disabled
espino.menu.Debug.Disabled.build.debug_port=
espino.menu.Debug.Serial=Serial
espino.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espino.menu.Debug.Serial1=Serial1
espino.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espino.menu.DebugLevel.None____=None
espino.menu.DebugLevel.None____.build.debug_level=
espino.menu.DebugLevel.SSL=SSL
espino.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
espino.menu.DebugLevel.TLS_MEM=TLS_MEM
espino.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espino.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
espino.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espino.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
espino.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
espino.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espino.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espino.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espino.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
espino.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espino.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espino.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espino.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espino.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espino.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espino.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espino.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espino.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espino.menu.DebugLevel.CORE=CORE
espino.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
espino.menu.DebugLevel.WIFI=WIFI
espino.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espino.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
espino.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espino.menu.DebugLevel.UPDATER=UPDATER
espino.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espino.menu.DebugLevel.OTA=OTA
espino.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
espino.menu.DebugLevel.OOM=OOM
espino.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
espino.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espino.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espino.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espino.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
espino.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espino.menu.FlashErase.none=Only Sketch
espino.menu.FlashErase.none.upload.erase_cmd=
espino.menu.FlashErase.sdk=Sketch + WiFi Settings
espino.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
espino.menu.FlashErase.all=All Flash Contents
espino.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
espino.menu.UploadSpeed.115200=115200
espino.menu.UploadSpeed.115200.upload.speed=115200
espino.menu.UploadSpeed.9600=9600
espino.menu.UploadSpeed.9600.upload.speed=9600
espino.menu.UploadSpeed.57600=57600
espino.menu.UploadSpeed.57600.upload.speed=57600
espino.menu.UploadSpeed.230400.linux=230400
espino.menu.UploadSpeed.230400.macosx=230400
espino.menu.UploadSpeed.230400.upload.speed=230400
espino.menu.UploadSpeed.256000.windows=256000
espino.menu.UploadSpeed.256000.upload.speed=256000
espino.menu.UploadSpeed.460800.linux=460800
espino.menu.UploadSpeed.460800.macosx=460800
espino.menu.UploadSpeed.460800.upload.speed=460800
espino.menu.UploadSpeed.512000.windows=512000
espino.menu.UploadSpeed.512000.upload.speed=512000
espino.menu.UploadSpeed.921600=921600
espino.menu.UploadSpeed.921600.upload.speed=921600

